spec/messages/process_payment_request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:man="https://www.eway.com.au/gateway/managedpayment">
  <soap:Header>
    <man:eWAYHeader>
      <man:eWAYCustomerID>87654321</man:eWAYCustomerID>
      <man:Username>test@eway.com.au</man:Username>
      <man:Password>test123</man:Password>
    </man:eWAYHeader>
  </soap:Header>
  <soap:Body>
    <man:ProcessPayment>
      <man:managedCustomerID>9876543211000</man:managedCustomerID>
      <man:amount>1000</man:amount>
      <man:invoiceReference>INV-80123</man:invoiceReference>
      <man:invoiceDescription>Payment for services rendered</man:invoiceDescription>
    </man:ProcessPayment>
  </soap:Body>
</soap:Envelope>
